tdd_app/app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    if @customer.save
---
INSERT INTO "customers" ("name", "email", "smoker", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Caio"], ["email", "teste@teste"], ["smoker", "S"], ["phone", "123"], ["created_at", "2019-08-27 20:00:43.858475"], ["updated_at", "2019-08-27 20:00:43.858475"]]

  def update
    if @customer.update(customer_params)
---
UPDATE "customers" SET "name" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["name", "Víctor Xavier"], ["updated_at", "2019-08-27 19:53:54.426810"], ["id", 89]]

  def destroy
    if @customer.destroy
---
DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 194]]